'''1. РЎРѕР·РґР°С‚СЊ РєР»Р°СЃСЃ TrafficLight (СЃРІРµС‚РѕС„РѕСЂ) Рё РѕРїСЂРµРґРµР»РёС‚СЊ Сѓ РЅРµРіРѕ РѕРґРёРЅ Р°С‚СЂРёР±СѓС‚
color (С†РІРµС‚) Рё РјРµС‚РѕРґ running (Р·Р°РїСѓСЃРє). РђС‚СЂРёР±СѓС‚ СЂРµР°Р»РёР·РѕРІР°С‚СЊ РєР°Рє РїСЂРёРІР°С‚РЅС‹Р№.
Р’ СЂР°РјРєР°С… РјРµС‚РѕРґР° СЂРµР°Р»РёР·РѕРІР°С‚СЊ РїРµСЂРµРєР»СЋС‡РµРЅРёРµ СЃРІРµС‚РѕС„РѕСЂР° РІ СЂРµР¶РёРјС‹: РєСЂР°СЃРЅС‹Р№, Р¶РµР»С‚С‹Р№, Р·РµР»РµРЅС‹Р№.
РџСЂРѕРґРѕР»Р¶РёС‚РµР»СЊРЅРѕСЃС‚СЊ РїРµСЂРІРѕРіРѕ СЃРѕСЃС‚РѕСЏРЅРёСЏ (РєСЂР°СЃРЅС‹Р№) СЃРѕСЃС‚Р°РІР»СЏРµС‚ 7 СЃРµРєСѓРЅРґ, РІС‚РѕСЂРѕРіРѕ
Р¶РµР»С‚С‹Р№) вЂ” 2 СЃРµРєСѓРЅРґС‹, С‚СЂРµС‚СЊРµРіРѕ (Р·РµР»РµРЅС‹Р№) вЂ” РЅР° РІР°С€Рµ СѓСЃРјРѕС‚СЂРµРЅРёРµ.
РџРµСЂРµРєР»СЋС‡РµРЅРёРµ РјРµР¶РґСѓ СЂРµР¶РёРјР°РјРё РґРѕР»Р¶РЅРѕ РѕСЃСѓС‰РµСЃС‚РІР»СЏС‚СЊСЃСЏ С‚РѕР»СЊРєРѕ РІ СѓРєР°Р·Р°РЅРЅРѕРј РїРѕСЂСЏРґРєРµ (РєСЂР°СЃРЅС‹Р№, Р¶РµР»С‚С‹Р№, Р·РµР»РµРЅС‹Р№).
РџСЂРѕРІРµСЂРёС‚СЊ СЂР°Р±РѕС‚Сѓ РїСЂРёРјРµСЂР°, СЃРѕР·РґР°РІ СЌРєР·РµРјРїР»СЏСЂ Рё РІС‹Р·РІР°РІ РѕРїРёСЃР°РЅРЅС‹Р№ РјРµС‚РѕРґ.
Р—Р°РґР°С‡Сѓ РјРѕР¶РЅРѕ СѓСЃР»РѕР¶РЅРёС‚СЊ, СЂРµР°Р»РёР·РѕРІР°РІ РїСЂРѕРІРµСЂРєСѓ РїРѕСЂСЏРґРєР° СЂРµР¶РёРјРѕРІ,
Рё РїСЂРё РµРіРѕ РЅР°СЂСѓС€РµРЅРёРё РІС‹РІРѕРґРёС‚СЊ СЃРѕРѕС‚РІРµС‚СЃС‚РІСѓСЋС‰РµРµ СЃРѕРѕР±С‰РµРЅРёРµ Рё Р·Р°РІРµСЂС€Р°С‚СЊ СЃРєСЂРёРїС‚.'''

from time import sleep
from itertools import cycle


class TrafficLight:

    def __init__(self):
        self.__color = (('Red', 5), ('Yellow', 2), ('Green', 4))

    def running(self):
        for color, sec in cycle(self.__color):
            print(color, '(wait {} sec)'.format(sec))
            sleep(sec)


traffic_light = TrafficLight()
traffic_light.running()

'''2. Р РµР°Р»РёР·РѕРІР°С‚СЊ РєР»Р°СЃСЃ Road (РґРѕСЂРѕРіР°), РІ РєРѕС‚РѕСЂРѕРј РѕРїСЂРµРґРµР»РёС‚СЊ Р°С‚СЂРёР±СѓС‚С‹: length (РґР»РёРЅР°), 
width (С€РёСЂРёРЅР°). Р—РЅР°С‡РµРЅРёСЏ РґР°РЅРЅС‹С… Р°С‚СЂРёР±СѓС‚РѕРІ РґРѕР»Р¶РЅС‹ РїРµСЂРµРґР°РІР°С‚СЊСЃСЏ РїСЂРё СЃРѕР·РґР°РЅРёРё СЌРєР·РµРјРїР»СЏСЂР° РєР»Р°СЃСЃР°.
РђС‚СЂРёР±СѓС‚С‹ СЃРґРµР»Р°С‚СЊ Р·Р°С‰РёС‰РµРЅРЅС‹РјРё. РћРїСЂРµРґРµР»РёС‚СЊ РјРµС‚РѕРґ СЂР°СЃС‡РµС‚Р° РјР°СЃСЃС‹ Р°СЃС„Р°Р»СЊС‚Р°, 
РЅРµРѕР±С…РѕРґРёРјРѕРіРѕ РґР»СЏ РїРѕРєСЂС‹С‚РёСЏ РІСЃРµРіРѕ РґРѕСЂРѕР¶РЅРѕРіРѕ РїРѕР»РѕС‚РЅР°. РСЃРїРѕР»СЊР·РѕРІР°С‚СЊ С„РѕСЂРјСѓР»Сѓ: 
РґР»РёРЅР° С€РёСЂРёРЅР° РјР°СЃСЃР° Р°СЃС„Р°Р»СЊС‚Р° РґР»СЏ РїРѕРєСЂС‹С‚РёСЏ РѕРґРЅРѕРіРѕ РєРІ РјРµС‚СЂР° РґРѕСЂРѕРіРё Р°СЃС„Р°Р»СЊС‚РѕРј, 
С‚РѕР»С‰РёРЅРѕР№ РІ 1 СЃРј*С‡РёСЃР»Рѕ СЃРј С‚РѕР»С‰РёРЅС‹ РїРѕР»РѕС‚РЅР°. РџСЂРѕРІРµСЂРёС‚СЊ СЂР°Р±РѕС‚Сѓ РјРµС‚РѕРґР°.
РќР°РїСЂРёРјРµСЂ: 20Рј*5000Рј*25РєРі*5СЃРј = 12500 С‚'''


class Road:
    def __init__(self, length, width):
        self._length = length
        self._width = width

    def calc_mass(self):
        mass = self._length * self._width * 25 * 5 / 1000
        return mass


my_road = Road(20, 5000)
print(my_road.calc_mass(), 'С‚')
'''3. Р РµР°Р»РёР·РѕРІР°С‚СЊ Р±Р°Р·РѕРІС‹Р№ РєР»Р°СЃСЃ Worker (СЂР°Р±РѕС‚РЅРёРє), РІ РєРѕС‚РѕСЂРѕРј РѕРїСЂРµРґРµР»РёС‚СЊ 
Р°С‚СЂРёР±СѓС‚С‹: name, surname, position (РґРѕР»Р¶РЅРѕСЃС‚СЊ), income (РґРѕС…РѕРґ). 
РџРѕСЃР»РµРґРЅРёР№ Р°С‚СЂРёР±СѓС‚ РґРѕР»Р¶РµРЅ Р±С‹С‚СЊ Р·Р°С‰РёС‰РµРЅРЅС‹Рј Рё СЃСЃС‹Р»Р°С‚СЊСЃСЏ РЅР° СЃР»РѕРІР°СЂСЊ, 
СЃРѕРґРµСЂР¶Р°С‰РёР№ СЌР»РµРјРµРЅС‚С‹: РѕРєР»Р°Рґ Рё РїСЂРµРјРёСЏ, РЅР°РїСЂРёРјРµСЂ, {"wage": wage, "bonus": bonus}.
РЎРѕР·РґР°С‚СЊ РєР»Р°СЃСЃ Position (РґРѕР»Р¶РЅРѕСЃС‚СЊ) РЅР° Р±Р°Р·Рµ РєР»Р°СЃСЃР° Worker. 
Р’ РєР»Р°СЃСЃРµ Position СЂРµР°Р»РёР·РѕРІР°С‚СЊ РјРµС‚РѕРґС‹ РїРѕР»СѓС‡РµРЅРёСЏ РїРѕР»РЅРѕРіРѕ РёРјРµРЅРё СЃРѕС‚СЂСѓРґРЅРёРєР° (get_full_name)
Рё РґРѕС…РѕРґР° СЃ СѓС‡РµС‚РѕРј РїСЂРµРјРёРё (get_total_income). РџСЂРѕРІРµСЂРёС‚СЊ СЂР°Р±РѕС‚Сѓ РїСЂРёРјРµСЂР° РЅР° СЂРµР°Р»СЊРЅС‹С… РґР°РЅРЅС‹С…
(СЃРѕР·РґР°С‚СЊ СЌРєР·РµРјРїР»СЏСЂС‹ РєР»Р°СЃСЃР° Position, РїРµСЂРµРґР°С‚СЊ РґР°РЅРЅС‹Рµ, РїСЂРѕРІРµСЂРёС‚СЊ Р·РЅР°С‡РµРЅРёСЏ Р°С‚СЂРёР±СѓС‚РѕРІ, 
РІС‹Р·РІР°С‚СЊ РјРµС‚РѕРґС‹ СЌРєР·РµРјРїР»СЏСЂРѕРІ).'''


class Worker:
    def __init__(self, name, surname, position, income):
        self.name = name
        self.surname = surname
        self.position = position
        self._income_wage = income['wage']
        self._income_bonus = income['bonus']


class Position(Worker):

    def get_full_name(self):
        return f'{self.name} {self.surname} {self.position}'

    def get_total_income(self):
        return self._income_wage + self._income_bonus


pos = Position('Ivan', 'Ivanov', 'senior', {"wage": 15000.54, "bonus": 50000.8})
print(pos.get_full_name())
print(pos.get_total_income())


# 4. Р РµР°Р»РёР·СѓР№С‚Рµ Р±Р°Р·РѕРІС‹Р№ РєР»Р°СЃСЃ Car. РЈ РґР°РЅРЅРѕРіРѕ РєР»Р°СЃСЃР° РґРѕР»Р¶РЅС‹ Р±С‹С‚СЊ СЃР»РµРґСѓСЋС‰РёРµ Р°С‚СЂРёР±СѓС‚С‹:
# speed, color, name, is_police (Р±СѓР»РµРІРѕ). Рђ С‚Р°РєР¶Рµ РјРµС‚РѕРґС‹: go, stop, turn(direction),
# РєРѕС‚РѕСЂС‹Рµ РґРѕР»Р¶РЅС‹ СЃРѕРѕР±С‰Р°С‚СЊ, С‡С‚Рѕ РјР°С€РёРЅР° РїРѕРµС…Р°Р»Р°, РѕСЃС‚Р°РЅРѕРІРёР»Р°СЃСЊ, РїРѕРІРµСЂРЅСѓР»Р° (РєСѓРґР°).
# РћРїРёС€РёС‚Рµ РЅРµСЃРєРѕР»СЊРєРѕ РґРѕС‡РµСЂРЅРёС… РєР»Р°СЃСЃРѕРІ: TownCar, SportCar, WorkCar, PoliceCar.
# Р”РѕР±Р°РІСЊС‚Рµ РІ Р±Р°Р·РѕРІС‹Р№ РєР»Р°СЃСЃ РјРµС‚РѕРґ show_speed, РєРѕС‚РѕСЂС‹Р№ РґРѕР»Р¶РµРЅ РїРѕРєР°Р·С‹РІР°С‚СЊ С‚РµРєСѓС‰СѓСЋ
# СЃРєРѕСЂРѕСЃС‚СЊ Р°РІС‚РѕРјРѕР±РёР»СЏ. Р”Р»СЏ РєР»Р°СЃСЃРѕРІ TownCar Рё WorkCar РїРµСЂРµРѕРїСЂРµРґРµР»РёС‚Рµ РјРµС‚РѕРґ show_speed.
# РџСЂРё Р·РЅР°С‡РµРЅРёРё СЃРєРѕСЂРѕСЃС‚Рё СЃРІС‹С€Рµ 60 (TownCar) Рё 40 (WorkCar) РґРѕР»Р¶РЅРѕ РІС‹РІРѕРґРёС‚СЊСЃСЏ СЃРѕРѕР±С‰РµРЅРёРµ
# Рѕ РїСЂРµРІС‹С€РµРЅРёРё СЃРєРѕСЂРѕСЃС‚Рё.
# РЎРѕР·РґР°Р№С‚Рµ СЌРєР·РµРјРїР»СЏСЂС‹ РєР»Р°СЃСЃРѕРІ, РїРµСЂРµРґР°Р№С‚Рµ Р·РЅР°С‡РµРЅРёСЏ Р°С‚СЂРёР±СѓС‚РѕРІ. Р’С‹РїРѕР»РЅРёС‚Рµ РґРѕСЃС‚СѓРї Рє Р°С‚СЂРёР±СѓС‚Р°Рј,
# РІС‹РІРµРґРёС‚Рµ СЂРµР·СѓР»СЊС‚Р°С‚. Р’С‹РїРѕР»РЅРёС‚Рµ РІС‹Р·РѕРІ РјРµС‚РѕРґРѕРІ Рё С‚Р°РєР¶Рµ РїРѕРєР°Р¶РёС‚Рµ СЂРµР·СѓР»СЊС‚Р°С‚.
#
class Car:
    def __init__(self, speed, color, name, is_police):
        self.speed = speed
        self.color = color
        self.name = name
        self.is_police = is_police

    def go(self):
        print('{} is going!'.format(self.name))

    def stop(self):
        print('{} is stoping!'.format(self.name))

    def turn(self, direction):
        print('{} is turning to {}!'.format(self.name, direction))

    def show_speed(self):
        print('Current speed:', self.speed)


class TownCar(Car):
    def show_speed(self):
        super().show_speed()
        if self.speed > 60:
            print('Warning! Your speed is more than max!')


class SportCar(Car):
    pass


class WorkCar(Car):
    def show_speed(self):
        print('Current speed:', self.speed)
        if self.speed > 40:
            print('Warning! Your speed is more than max!')


class PoliceCar(Car):
    pass


sport_car = SportCar(240, 'РљСЂР°СЃРЅР°СЏ', 'РЎРїРѕСЂС‚РёРІРЅР°СЏ РјР°С€РёРЅР°', False)
town_car = TownCar(140, 'РЎРµСЂР°СЏ', 'Р“РѕСЂРѕРґСЃРєР°СЏ РјР°С€РёРЅР°', False)
work_car = WorkCar(90, 'Р–РµР»С‚Р°СЏ', 'Р Р°Р±РѕС‡Р°СЏ РјР°С€РёРЅР°', False)
police_car = PoliceCar(210, 'РЎРёРЅСЏСЏ', 'РџРѕР»РёС†РµР№СЃРєР°СЏ РјР°С€РёРЅР°', True)

sport_car.show_speed()
town_car.show_speed()
work_car.show_speed()
police_car.show_speed()
sport_car.turn('left')

'''5. Р РµР°Р»РёР·РѕРІР°С‚СЊ РєР»Р°СЃСЃ Stationery (РєР°РЅС†РµР»СЏСЂСЃРєР°СЏ РїСЂРёРЅР°РґР»РµР¶РЅРѕСЃС‚СЊ). 
РћРїСЂРµРґРµР»РёС‚СЊ РІ РЅРµРј Р°С‚СЂРёР±СѓС‚ title (РЅР°Р·РІР°РЅРёРµ) Рё РјРµС‚РѕРґ draw (РѕС‚СЂРёСЃРѕРІРєР°). 
РњРµС‚РѕРґ РІС‹РІРѕРґРёС‚ СЃРѕРѕР±С‰РµРЅРёРµ вЂњР—Р°РїСѓСЃРє РѕС‚СЂРёСЃРѕРІРєРё.вЂќ РЎРѕР·РґР°С‚СЊ С‚СЂРё РґРѕС‡РµСЂРЅРёС… РєР»Р°СЃСЃР° 
Pen (СЂСѓС‡РєР°), Pencil (РєР°СЂР°РЅРґР°С€), Handle (РјР°СЂРєРµСЂ). Р’ РєР°Р¶РґРѕРј РёР· РєР»Р°СЃСЃРѕРІ 
СЂРµР°Р»РёР·РѕРІР°С‚СЊ РїРµСЂРµРѕРїСЂРµРґРµР»РµРЅРёРµ РјРµС‚РѕРґР° draw. Р”Р»СЏ РєР°Р¶РґРѕРіРѕ РёР· РєР»Р°СЃСЃРѕРІ РјРµС‚РѕРґС‹ 
РґРѕР»Р¶РµРЅ РІС‹РІРѕРґРёС‚СЊ СѓРЅРёРєР°Р»СЊРЅРѕРµ СЃРѕРѕР±С‰РµРЅРёРµ. РЎРѕР·РґР°С‚СЊ СЌРєР·РµРјРїР»СЏСЂС‹ РєР»Р°СЃСЃРѕРІ Рё РїСЂРѕРІРµСЂРёС‚СЊ, 
С‡С‚Рѕ РІС‹РІРµРґРµС‚ РѕРїРёСЃР°РЅРЅС‹Р№ РјРµС‚РѕРґ РґР»СЏ РєР°Р¶РґРѕРіРѕ СЌРєР·РµРјРїР»СЏСЂР°.'''


class Stationery:
    def __init__(self, title):
        self.title = title

    def draw(self):
        print('Р—Р°РїСѓСЃРє РѕС‚СЂРёСЃРѕРІРєРё')


class Pen(Stationery):
    def draw(self):
        print('Р СѓС‡РєР° СЂРёСЃСѓРµС‚')


class Pencil(Stationery):
    def draw(self):
        print('РљР°СЂР°РЅРґР°С€ СЂРёСЃСѓРµС‚')


class Handle(Stationery):
    def draw(self):
        print('РњР°СЂРєРµСЂ СЂРёСЃСѓРµС‚')


pen = Pen('СЂСѓС‡РєР°')
pencil = Pencil('РєР°СЂР°РЅРґР°С€')
handle = Handle('РјР°СЂРєРµСЂ')

pen.draw()
pencil.draw()
handle.draw()
